# Dataframes

In [1]:
import pandas as pd

In [2]:
data = {
    "nome": ["teo", "nah", "lara", "maria"],
    "sobrenome": ["calvo", "ataide", "calvo", "calvo"],
    "idade": [31, 32, 31, 2]
}

In [3]:
data["idade"][0]

31

In [4]:
df = pd.DataFrame(data)
df

    nome sobrenome  idade
0    teo     calvo     31
1    nah    ataide     32
2   lara     calvo     31
3  maria     calvo      2

In [6]:
df["idade"].iloc[0]

np.int64(31)

In [7]:
df["sobrenome"].iloc[0]

'calvo'

In [8]:
df.iloc[0]

nome           teo
sobrenome    calvo
idade           31
Name: 0, dtype: object

In [9]:
df["idade"]

0    31
1    32
2    31
3     2
Name: idade, dtype: int64

In [10]:
df.index=[3,2,1,0]
df

    nome sobrenome  idade
3    teo     calvo     31
2    nah    ataide     32
1   lara     calvo     31
0  maria     calvo      2

In [11]:
df["idade"][0]

np.int64(2)

In [12]:
df["idade"].iloc[0]

np.int64(31)

In [13]:
df.columns

Index(['nome', 'sobrenome', 'idade'], dtype='object')

In [16]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 3 to 0
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nome       4 non-null      object
 1   sobrenome  4 non-null      object
 2   idade      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 664.0 bytes

In [17]:
df.dtypes

nome         object
sobrenome    object
idade         int64
dtype: object

In [19]:
df["peso"] = [80, 53, 64, 14]

df.describe()

          idade       peso
count   4.00000   4.000000
mean   24.00000  52.750000
std    14.67424  28.111386
min     2.00000  14.000000
25%    23.75000  43.250000
50%    31.00000  58.500000
75%    31.25000  68.000000
max    32.00000  80.000000

In [20]:
df.head(2)

  nome sobrenome  idade  peso
3  teo     calvo     31    80
2  nah    ataide     32    53

In [21]:
df.tail(2)

    nome sobrenome  idade  peso
1   lara     calvo     31    64
0  maria     calvo      2    14